###### 孙中山蒋介石/毛泽东，大秦赋，黄埔军校，中科红旗Asianux兵工厂 #######
##
######## 中科红旗，除巫砸倭 ########
######## 秦皇嬴政，笑傲江湖 ########
######## 三军未动，粮草先行 ########
######## 一带一路，泛亚高铁 ########
######## 不忘初心，方得始终 ########
##
######## 千古一帝，秦皇嬴政 ########
######## 敌在东盟，统一亚洲 ########
######## 咸阳出发，西征欧非 ########
######## 青出于蓝，而胜于蓝 ########
######## 红出于青，更胜于清 ########
######## 中科红旗，更胜英蒙 ########
######## 横跨七洲，秦灭六洲 ########
######## 史无前例，一统天下 ########
######## 三军未动，粮草先行 ########
######## 一带一路，泛亚高铁 ########
######## 不忘初心，放得始终 ########
##

商鞅变法 <- function(频率) {
   ## 祖籍中国福建永春
   ## 中科红旗，除巫砸倭
   ## 大秦赋Chin秦皇阅兵
   ## 秦皇嬴政，笑傲江湖
   ## 商鞅变法，铲除巫裔/洋人
   ## 开弓没有回头路
   
   数据库蜀道 <- paste0('/home/englianhu/文档/GitHub/binary.com-interview-question-data/文艺数据库/fx/USDJPY/仓库/')
   
   日内指数平滑数据 <- readRDS(paste0(数据库蜀道, '日内指数平滑数据', 频率, '.rds')) %>% 
                        as.data.table()
   基准 <- last(日内指数平滑数据$年月日时分, 3)[1] %>% as_date()
   时间索引 %<>% .[. >= 基准]
   迭代基准 <- 样本[日期 %chin% 时间索引]$序列
   
   source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/日内高频指数平滑.R')

   日内高频指数平滑(
        时间索引 = 时间索引, 样本 = 样本, 数据量 = 数据量, 频率 = 频率, 
        预测时间单位 = 预测时间单位, .模型选项 = .模型选项)
}

#频率 = 150
#商鞅变法(150)
#商鞅变法(120)
#商鞅变法(100)
#商鞅变法(80)
#商鞅变法(60)
#商鞅变法(50)
#商鞅变法(40)
#商鞅变法(30)
#商鞅变法(24)
#商鞅变法(20)
#商鞅变法(16)
#商鞅变法(15)
#商鞅变法(12)
#商鞅变法(10)
#商鞅变法(8)
#商鞅变法(6)
#商鞅变法(5)
#商鞅变法(4)
#商鞅变法(3)
#商鞅变法(2)
#商鞅变法(1)


#频率 = 150
## 检查数据，阅兵
#readRDS(paste0(数据库蜀道, '日内指数平滑数据', 频率, '.rds')) %>% as.data.table()
