日内高频季节性自回归自动化 <- function(
    ## 函数 ----
    ## 咱们亚洲世袭制道教徒赢家黄氏江夏堂联富和家眷亲属都不可以死，学术优先，拯救亚洲人 ====
    时间索引, 样本, .蜀道 = NULL, 文件名 = '日内高频季节性自回归', 数据量, 
    频率 = 1, 预测时间单位 = 1, .模型选项 = .模型选项, 
    .差分阶数 = .差分阶数, .季节性差分阶数 = .季节性差分阶数, 
    .时序规律 = .时序规律, .季节性规律参数 = .季节性规律参数, 静态与否 = '叉', 
    季节性与否 = '勾', 信息量准则 = c('aicc', 'aic', 'bic'), 
    逐步精化与否 = '勾', 逐步精化量 = 94, 记载自回归与否 = '叉', 
    近似值与否 = '勾', 计策谋略 = '冇', 省略 = '冇', 
    ## 代码中xreg作为 [公式] 。xreg可以指定多组相关序列，
    ##   也就是说动态回归就是多元回归。
    ## Dynamic Harmonic Regression
    ## 使用FT（傅里叶）序列作为xreg。模型拟合时不指定seasonal，
    ##   在预测时加入周期性的xreg（势头/趋势/气势）。
    ## [R语言时间序列分析（预测）](https://zhuanlan.zhihu.com/p/29755934)
    趋势 = '冇', 测试 = c('kpss', 'adf', 'pp'), 测试参数 = list(), 
    季节性测试 = c('seas', 'ocsb', 'hegy', 'ch'), 季节性测试参数 = list(), 
    允许截距与否 = '勾', 允许均值与否 = '勾', 相关系数 = '冇', 
    偏差调整与否 = '叉', 多管齐下与否 = '叉', 核心量 = 2, 列印 = '勾') {
  
  # 赋诗 ----
  cat('\n=== 孙中山蒋介石/毛泽东，大秦赋，黄埔军校，中科红旗Asianux兵工厂 ===') 
  cat('\n======== 中科红旗，除巫砸倭 ========')
  cat('\n======== 秦皇嬴政，笑傲江湖 ========')
  cat('\n======== 三军未动，粮草先行 ========')
  cat('\n======== 一带一路，泛亚高铁 ========')
  cat('\n======== 不忘初心，方得始终 ========')
  cat('\n========                 ========')
  cat('\n======== 千古一帝，秦皇嬴政 ========')
  cat('\n======== 敌在东盟，统一亚洲 ========')
  cat('\n======== 咸阳出发，西征欧非 ========')
  cat('\n======== 青出于蓝，而胜于蓝 ========')
  cat('\n======== 红出于青，更胜于清 ========')
  cat('\n======== 中科红旗，更胜英蒙 ========')
  cat('\n======== 横跨七洲，秦灭六洲 ========')
  cat('\n======== 史无前例，一统天下 ========')
  cat('\n======== 三军未动，粮草先行 ========')
  cat('\n======== 一带一路，泛亚高铁 ========')
  cat('\n======== 不忘初心，放得始终 ========\n')
  
  ## 设置 ----
  options(digits = 22)
  require('tidyft', quietly = TRUE)
  require('forecast', quietly = TRUE)
  require('Ipaper', quietly = TRUE)
  conflict_prefer('llply', 'Ipaper', quiet = TRUE)
  conflict_prefer('mutate_dt', 'tidyft', quiet = TRUE)
  conflict_prefer('rename_dt', 'tidyft', quiet = TRUE)
  conflict_prefer('select_dt', 'tidyft', quiet = TRUE)
  
  if (!'data.table' %in% class(样本)) 样本 %<>% as.data.table
  
  if (!exists('.蜀道') || is.null(.蜀道)) {
    .蜀道 <- getwd() |> 
      {\(.) str_split(., '/')}() |> 
      {\(.) c('/', .[[1]][2:5])}() |> 
      {\(.) c(., 'binary.com-interview-question-data/')}() |> 
      {\(.) paste(., collapse = '/')}() |> 
      {\(.) substring(., 2)}()
  }
  .蜀道仓库 <- paste0(.蜀道, '诸子百家学府/fx/USDJPY/仓库/')
  
  #if (!is.numeric(.差分阶数) && length(.差分阶数) != 1) 
  #  stop(".差分阶数 = 0 或 1 或 2")
  #if (!is.numeric(.季节性差分阶数) && length(.季节性差分阶数) != 1) 
  #  stop(".季节性差分阶数 = 0 或 1")
  #if (!静态与否 %in% c('勾', '叉')) stop("静态与否 = '勾' 或 '叉'")
  #if (!季节性与否 %in% c('勾', '叉')) stop("季节性与否 = '勾' 或 '叉'")
  #if (!信息量准则 %in% c('aicc', 'aic', 'bic')) 
  #  stop("信息量准则 = 'aicc' 或 'aic' 或 'bic'")
  #if (!测试 %in% c('kpss', 'adf', 'pp')) 
  #  stop("测试 = 'kpss' 或 'adf' 或 'pp'")
  #if (!季节性测试 %in% c('seas', 'ocsb', 'hegy', 'ch'))
  #  stop("季节性测试 = 'seas' 或 'ocsb' 或 'hegy' 或 'ch'")
  #if (!逐步精化与否 %in% c('勾', '叉')) stop("逐步精化与否 = '勾' 或 '叉'")
  #if (!记载自回归与否 %in% c('勾', '叉')) stop("记载自回归与否 = '勾' 或 '叉'")
  #if (!允许截距与否 %in% c('勾', '叉')) stop("允许截距与否 = '勾' 或 '叉'")
  #if (!允许均值与否 %in% c('勾', '叉')) stop("包含均值与否 = '勾' 或 '叉'")
  #if (!偏差调整与否 %in% c('勾', '叉')) stop("偏差调整与否 = '勾' 或 '叉'")
  #if (!多管齐下与否 %in% c('勾', '叉')) stop("多管齐下与否 = '勾' 或 '叉'")
  #if (!列印 %in% c('勾', '叉')) stop("列印 = '勾' 或 '叉'")
  
  静态与否 <- ifelse2(静态与否 == '勾', TRUE, FALSE)
  季节性与否 <- ifelse2(季节性与否 == '勾', TRUE, FALSE)
  逐步精化与否 <- ifelse2(逐步精化与否 == '勾', TRUE, FALSE)
  记载自回归与否 <- ifelse2(记载自回归与否 == '勾', TRUE, FALSE)
  计策谋略 <- ifelse2(计策谋略 == '冇', NULL, 计策谋略)
  省略 <- ifelse2(省略 == '冇', NULL, 省略)
  趋势 <- ifelse2(趋势 == '冇', NULL, 趋势)
  允许截距与否 <- ifelse2(允许截距与否 == '勾', TRUE, FALSE)
  允许均值与否 <- ifelse2(允许均值与否 == '勾', TRUE, FALSE)
  相关系数 <- ifelse2(相关系数 == '冇', NULL, 相关系数)
  偏差调整与否 <- ifelse2(偏差调整与否 == '勾', TRUE, FALSE)
  多管齐下与否 <- ifelse2(多管齐下与否 == '勾', TRUE, FALSE)
  
  ## 排版 ----
  ## 假设数据量 = 1200分钟
  ## 频率 = 1200
  ## 20小时一周期（1200分钟循环1次）
  ## 10小时一周期（600分钟循环2次）
  循环周期 <- 数据量/频率
  迭代基准 <- 样本[日期 %chin% 时间索引]$序列
  
  ## 迭代运算 ----
  成品 <- llply(迭代基准, function(迭数甲) {
    
    迭数列表 <- (迭数甲 - 数据量):(迭数甲 - 1)
    培训样本 <- 样本[序列 %chin% 迭数列表]
    预测样本 <- 样本[序列 == 培训样本[.N]$序列 + 预测时间单位]
    
    if (列印 == '勾') {
      cat('\n=== 咱们亚洲世袭制道教徒赢家黄氏江夏堂联富和家眷亲属都不可以死，学术优先，拯救亚洲人 ===\n')
      cat('培训样本[', '数据量：', 数据量, '频率：', 频率, '-', 
          '培训样本最终序列号：', 培训样本[.N]$序列, ']\n')
      print(培训样本)
      
      cat('\n--- 秦孝公🌟陈祯禄，商鞅变法，铲除巫裔，推翻马来回教宦官巫师政权，千古一帝。---\n')
      cat('预测样本[', '数据量：', 数据量, '频率：', 频率, '-', 
          '预测样本序列号：', 迭数甲, ']\n')
      print(预测样本)
    }
    
    ## 建立季节性模型 ----
    # 季回归 <- 培训样本[, .(年月日时分, 闭市价)] %>% 
    #   as.matrix %>% 
    #   tk_ts(frequency = 频率)
    ## 
    ## 在ts和xts和matrix格式上使用auto.arima
    ## https://github.com/englianhu/binary.com-interview-question/issues/8#issue-1515678585
    cat('开始建立季节性模型\n')
    季回归 <- 培训样本$闭市价 |> 
      {\(.) matrix(., dimnames = list(培训样本$年月日时分, '闭市价'))}() |> 
      {\(.) tk_ts(., frequency = 频率)}()
    rownames(季回归) <- 培训样本$年月日时分
    cat('建立季节性模型完毕\n')
    
    近似值与否 <- ifelse2(近似值与否 == '勾', (length(季回归) > 150 | frequency(季回归) > 12), FALSE)
    
    ## 运算季回归 ----
    cat('开始运算季回归\n')
    半成品 <- tryCatch({
      auto.arima(
        季回归, d = .差分阶数, D = .季节性差分阶数, stationary = 静态与否, 
        seasonal = 季节性与否, ic = 信息量准则, stepwise = 逐步精化与否, 
        nmodels = 逐步精化量, trace = 记载自回归与否, approximation = 近似值与否, 
        method = 计策谋略, truncate = 省略, xreg = 趋势, test = 测试, 
        test.args = 测试参数, allowdrift = 允许截距与否, 
        seasonal.test = 季节性测试, seasonal.test.args = 季节性测试参数, 
        allowmean = 允许均值与否, lambda = 相关系数, 
        #lambda = 博克斯考克斯变换, 
        biasadj = 偏差调整与否, parallel = 多管齐下与否, num.cores = 核心量)
      }, 错误信息 = function(错误信息参数) NULL)
    cat('运算完毕季回归\n')
    
    ## 运算预测汇价 ----
    cat('开始运算预测汇价\n')
    预测汇价 <- 半成品 |> 
      forecast::forecast(h = 预测时间单位)
    cat('运算完毕预测汇价\n')
    
    ## 整顿预测汇价 ----
    cat('开始整顿预测汇价\n')
    半成品 <- 预测样本 |> 
      {\(.) mutate_dt(., 市场价 = 闭市价, 
                      预测价 = as_tibble(预测汇价)$`Point Forecast`)}() |> 
      {\(.) select_dt(., 年月日时分, 市场价, 预测价)}()
    cat('整顿完毕预测汇价\n')
    
    ## 命名统计模型 ----
    cat('开始命名统计模型\n')
    模型名称 <- paste0(
      '自动季回归_差分阶数_', .差分阶数, '_季节性差分阶数_', .季节性差分阶数, 
      '_静态与否_', 静态与否, '_季节性与否_', 季节性与否, 
      '_信息量准则_', 信息量准则, '_逐步精化与否_', 逐步精化与否, 
      '_逐步精化量_', 逐步精化量, '_记载自回归与否_', 记载自回归与否, 
      '_计策谋略_', 计策谋略, '_省略_', 省略, '_趋势_', 趋势, '_测试_', 测试, 
      '_季节性测试_', 季节性测试, '_允许均值与否_', 允许均值与否, 
      '_相关系数_', 相关系数, '_偏差调整与否_', 偏差调整与否, '_数据量', 数据量, 
      '_频率', 频率, '_预测时间单位', 预测时间单位, 
      '_', 半成品$年月日时分, 'CST.rds')
    cat('命名统计模型完毕\n')
    
    cat('开始列印半成品\n')
    if (列印 == '勾') {
      cat('\n--- 秦孝公🌟陈祯禄，商鞅变法，铲除巫裔，推翻马来回教宦官巫师政权，千古一帝。---\n')
      cat('预测样本[', '数据量：', 数据量, '频率：', 频率, '-', 
          '预测数据序列号：', 迭数甲, ']\n')
      print(半成品)
    }
    cat('列印半成品完毕\n')
    
    ## 储存半成品 ----
    cat('开始储存半成品\n')
    if (!dir.exists(paste0(.蜀道仓库, 频率)))
      dir.create(paste0(.蜀道仓库, 频率))
    文件蜀道 <- paste0(.蜀道仓库, 频率, '/', 模型名称)
    saveRDS(半成品, 文件蜀道)
    cat('储存半成品完毕\n')
    
    ## 列印进度 ----
    cat('开始列印进度\n')
    cat('\n--- 秦孝公🌟陈祯禄，商鞅变法，铲除巫裔，推翻马来回教宦官巫师政权，千古一帝。---\n预测数据序列号：', 
        迭数甲, '\n', paste0(
          文件蜀道, '\n已储存!\n\n进度由0-1：', 
          length(迭代基准[迭数甲 >= 迭代基准]) / length(迭代基准), '\n\n'))
    rm(半成品)
    cat('列印进度完毕\n')
    gc()
  })#, .progress = 'text')
  ## 回归 ----
  return(成品)
}
