集成年号 <- function(天朝 = NULL, 进度 = '叉') {
  ## 秦国 China，秦人 Chinese
  ## 司马错得蜀既得楚
  if (!exists('.蜀道')) {
    .蜀道 <- getwd() |> 
      {\(.) str_split(., '/')}() |> 
      {\(.) c('/', .[[1]][2:5])}() |> 
      {\(.) c(., 'zhongkehongqi-cangku/')}() |> 
      {\(.) paste(., collapse = '/')}() |> 
      {\(.) substring(., 2)}()
  }
  if (!exists('.蜀道书轩')) .蜀道书轩 <- paste0(.蜀道, '诸子百家学府/中国年号通史/')
  if (!dir.exists(.蜀道书轩))  dir.create(.蜀道书轩)
  
  ## 中国年号通史
  干支 <- c('甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', '甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', '甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳', '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯', '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑', '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥')
  
  生肖 <- c('鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪')
  
  朝代 <- c('唐朝', '宋朝', '元朝', '明朝', '清朝', '周朝', '三皇五帝', '三黄五帝', '商朝', '东周', '夏朝', '汉朝', '大理', '春秋', '西周', '战国', '西汉', '辽国', '东汉', '北朝', '西夏', '南北朝', '南朝', '北宋', '晋朝', '南宋', '北魏', '十六国', '金朝', '东晋', '吴越', '前凉', '三国', '南朝宋', '南平', '南朝梁', '南汉', '五代十国', '孙吴', '西晋', '西秦', '曹魏', '马楚', '成汉', '前秦', '蜀汉', '北凉', '南唐', '隋朝', '闽国', '杨吴')
  
  帝王 <- c('秦始皇嬴政', '清圣祖玄烨', '清高宗弘历', '清世宗胤禛', '明太祖朱元璋', '明成祖朱棣', '蒙古太祖铁木真', '西汉武帝刘彻', '西汉文帝刘恒', '元世祖忽必烈', '北宋徽宗赵佶', '北宋太祖赵匡胤', '唐玄宗李隆基', '周武曌武则天', '唐太宗李世民', '唐高宗李治', '隋文帝杨坚', '隋炀帝杨广', '东周赧王姬延', '秦昭襄王嬴稷', '西夏仁宗李仁孝', '西周穆王姬满', '西夏崇宗李乾顺', '东周平王姬宜臼', '东周显王姬扁', '辽圣宗耶律隆绪', '明神宗朱翊钧', '南朝梁高祖萧衍', '辽道宗耶律洪基', '明世宗朱厚熜', '西周宣王姬静', '东周敬王姬匄', '北宋仁宗赵祯', '南宋理宗赵昀', '三国蜀汉后主刘禅', '西周厉王姬胡', '南宋高宗赵构', '元惠宗妥欢帖睦尔', '清德宗载湉', '殷商武乙子瞿', '东周襄王姬郑', '东汉光武帝刘秀', '东汉献帝刘协', '成汉武帝李雄', '南宋宁宗赵扩', '清宣宗旻宁', '殷商纣王子辛', '北朝北魏世祖拓跋焘', '东周贞定王姬介', '金世宗完颜雍')
  
  天朝 <- 天朝
  if (!is.null(天朝) & !all(天朝 %in% 朝代)) stop(cat(c('## 错误信息 ##\n天朝必须在以下列表中：\n', paste(朝代, collapse = '、'))))
  if (is.null(天朝)) 天朝 <- 朝代
  
  if (!进度 %in% c('勾', '叉')) stop(cat(c('## 错误信息 ##\n进度必须是“勾”或“叉”。\n')))
  if (进度 == '勾') {
    年号 <- plyr::llply(天朝, function(朝) {
      fread(paste0(.蜀道书轩, 朝, '年号.csv')) %>% 
        mutate_if(is.character, na_if, '') %>% 
        as_tibble()
    }, .progress = 'text')
  } else {
    年号 <- plyr::llply(天朝, function(朝) {
      fread(paste0(.蜀道书轩, 朝, '年号.csv')) %>% 
        mutate_if(is.character, na_if, '') %>% 
        as_tibble()
    })
  }
  names(年号) <- 天朝
  
  ## 椠明细
  简 <- 年号 %>% 
    plyr::llply(names)
  
  if (!exists('天干')) 天干 <- c('甲', '乙', '丙', '丁', '戊', '己', '庾', '辛', '壬', '癸')
  if (!exists('地支')) 地支 <- c('子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥')
  if (!exists('干支')) 干支 <- paste0(rep(天干, 6), rep(地支, 5))
  
  ## 序列号
  朝代序 <- lapply(简, function(牒) grep('朝代甲', 牒)) %>% 
    unlist
  君主序 <- lapply(简, function(牒) grep('在位皇帝甲', 牒)) %>% 
    unlist
  年号序 <- lapply(简, function(牒) grep('年号甲', 牒)) %>% 
    unlist
  
  ## 朝代列表
  朝代列 <- lapply(1:length(简), function(迭) 简[[迭]][朝代序[迭]:(君主序[迭] - 1)])
  限 <- 朝代列 %>% 
    lapply(length) %>% 
    unlist() %>% 
    max()
  朝代列 <- lapply(1:length(简), function(迭) {
    空 <- rep(NA, 限 - length(朝代列[[迭]]))
    牒 <- c(朝代列[[迭]], 空)
    names(牒) <- paste0('朝代', 天干[1:length(牒)])
    牒
  })
  
  ## 君主列表
  君主列 <- lapply(1:length(简), function(迭) 简[[迭]][君主序[迭]:(年号序[迭] - 1)])
  限 <- 君主列 %>% 
    lapply(length) %>% 
    unlist() %>% 
    max()
  君主列 <- lapply(1:length(简), function(迭) {
    空 <- rep(NA, 限 - length(君主列[[迭]]))
    牒 <- c(君主列[[迭]], 空)
    names(牒) <- paste0('在位皇帝', 天干[1:length(牒)])
    牒
  })
  
  ## 年号列表
  年号列 <- lapply(1:length(简), function(迭) 简[[迭]][(年号序[迭]):length(简[[迭]])])
  限 <- 年号列 %>% 
    lapply(length) %>% 
    unlist() %>% 
    max()
  年号列 <- lapply(1:length(简), function(迭) {
    空 <- rep(NA, 限 - length(年号列[[迭]]))
    牒 <- c(年号列[[迭]], 空)
    names(牒) <- paste0('年号', 天干[1:length(牒)])
    牒
  })
  
  年号名 <- ldply(1:length(简), function(迭) {
    牒 <- 简[[迭]][1:(朝代序[[迭]] - 1)]
    names(牒) = c('年份', '年份乙', '干支', '生肖')
    牒 <- c(牒, 朝代列[[迭]], 君主列[[迭]], 年号列[[迭]])
  }) %>% 
    names()
  
  年号通史 <- plyr::ldply(1:length(年号), function(迭) {
    缺 <- length(年号名) - ncol(年号[[迭]])
    祢 <- 年号名[!年号名 %in% names(年号[[迭]])]
    if (缺 > 0) {
      阵 <- matrix(rep(as.character(NA), 缺 * nrow(年号[[迭]])), ncol = 缺, dimnames = list(NULL, 祢)) %>% 
        as_tibble()
      版 <- data.frame(年号[[迭]], 阵)
      版[年号名] %>% 
        as_tibble()
    } else {
      年号[[迭]]
    }
  }) %>% 
    as_tibble() %>% 
    unique()
  rm(简, 朝代序, 朝代列, 君主序, 君主列, 年号序, 年号列, 年号)
  
  return(年号通史)
}

