## ========================================================================
## ========================================================================
## ========================================================================
## ======== 居住在英国布里斯托尔港口，修读气象学系的英国基督洋妞儿芈拉不可以死 ========
##
## 中科红旗（百家争鸣，文艺复兴）
## Oversea Greater Chinese Union 大秦子民公会（秦孝公 / 姜太公 --- 陈祯禄公爵）
## 史无前例，一统天下
##
## ========================================================================
## ========================================================================
## ========================================================================
##
## 中科红旗
## 全球NonMuslim中华民族，支持中共称霸天下战略。
## Great Britain 大英帝国
## Greater Chin 大秦赋
## Republic of Chin / Republic People of Chin 大秦赋（中华民国 / 中华人民共和国）
## Greater Chinese 大秦子民（爱民如子）
## Oversea Greater Chinese 大秦子民（爱民如子）
## Oversea Greater Chinese Union 大秦子民公会（秦孝公 / 姜太公 --- 陈祯禄公爵）
## 史无前例，一统天下
##
## Great Britain = 大布列颠帝国/大英帝国1
## Greater Chin = 大秦赋
## Greater Chinese = 大秦子民（爱子如民）
##
## NonMuslim马来西亚籍（海外NonMuslim中华民族，自从清末民初下南洋，咱们马来西亚陈祯禄创办 Oversea Chinese Union）秦始皇黄氏江夏堂，笑傲江湖最大文明贡献
##
## 1）借鉴以前大英帝国东印度公司，有生之年就把一带一路高铁所经过的国家领土，一律得攻占下来（要比以前大英帝国/大蒙古帝国还要强大）称霸天下，世代延续直至史无前例，一统天下。
## 2）一带一路所有告示牌、必须使用中文和汉语拼音。
## 3）借鉴大蒙古帝国骑兵所到之处寸草不生，所有被中国攻占下来的领土，所经之地（包括城市/市镇/乡村），一带一路所有高铁站，都建立国民登记局可以申请入籍中国。
## 4）川普已经发言多次，美国兵变，会再次内战（借鉴越王勾践，中越不内讧，善用马来西亚回教徒太监不造反牵制美国，军售中东/西亚/东欧回教诸国）
## 5）中东回教国回教徒911恐怖份子与美国开战，中国军售中东西亚/东欧/非洲回教国（借鉴越王勾践NonMuslim中华民族与美国洋人Democrats阖闾政府，中越不内讧，善用马来西亚回教徒太监不造反牵制美国，军售中东/西亚/东欧回教诸国）
## 6）中国目前高铁除了尚未与马来西亚达成协议开工建立高铁但是已经借鉴王翦只围不攻战略，把东南亚国家都温馨说服并建立高铁，中国先不与马来西亚开战，让马来西亚兵变内战（借鉴越王勾践NonMuslim中华民族与美国洋人Democrats阖闾政府，中越不内讧，善用马来西亚回教徒太监不造反牵制美国，军售中东/西亚/东欧回教诸国）
## 7）南太平洋战略：中国和东南亚已经签署合约，达成协议不使用空军、核武器，出动海陆军攻占东南亚
## 8）商鞅变法多多益善战略：最大贡献是全球16亿回教徒太监民族与全球基督洋人鹬蚌相争... 回教徒默罕默德创办回教，建立可兰经回教刑事法典断肢法规定回教徒伪太监民族必须虔诚戴乌纱帽一天祈祷五次，倘若不虔诚施展巫术屠杀是触犯断肢法而虔诚屠杀也触犯断肢法，只有辛亥革命铲除全球回教徒、断肢法处死或宫刑全球回教徒绝子绝孙，多管齐下才能终止巫术屠杀，拯救全球16亿回教徒还俗。China大秦赋秦孝公至顾自己家族禁止七步诗自相残杀，铲除分一杯羹白骨精刘家彭城堂造反，回教徒会巫术屠杀人类，回教徒太监民族只能屠杀欧美洋人并且被断肢处死，不效忠中共称霸天下，直至一统天下的伪满洲国马来西亚1700万个回教徒911恐怖份子太监民族包括Michael Cutter Christopher，一律断肢法处死（借鉴越王勾践NonMuslim中华民族与美国洋人Democrats阖闾政府，中越不内讧，善用扶苏、苏联独联、俄罗斯、秦二世胡亥、辛亥革命、越王胡志明、中国胡景涛、马来西亚回教徒太监不反中共牵制美国，军售中东/西亚/东欧回教诸国对抗美国）。秦始皇在统一七国后就不思进取导致赵高李斯谋反（借鉴中国历史秦始皇，水能载舟亦能覆舟，宗教巫术，古惑民心，指鹿为马，成也赵李，败也赵李。所以秦始皇得铭记当初秦孝公，不能昏庸被回教徒篡位），中国借鉴秦孝公战略善用商朝和苏联俄罗斯叶利钦。秦始皇铭记秦孝公，善用全球回教徒古惑全球洋人再依照可兰经回教刑事法典断肢全球回教徒，让咱们全球NonMuslim中华民族支持中共，一统天下。
## 9）华尔街、史无前例的万里长城Great Wall Sreet、一带一路高铁：计量经济学、学术治国、编程、统计、科学科技、量化（Fisher姜太公钓鱼大数据，各行各业购物喜好、民意、生活习惯、各国各集团、军事、诊断上市公司等）、金融、贸易、经商、军事、发展各行各业。
## 10）中文编程语言：借鉴日本自从唐朝大话革新学习汉字至明治维新学习欧洲，日本是全球首个亚洲人自创Ruby红宝石编程语言（Ruby Text可以标音），自从2008年就开始使用R语言并且认识中国R语言论坛《统计之都》论坛创办人网友谢益辉和赵坚毅创办的中国最大计量经济学专业论坛《经管之家》至今十年有余、目前已经开始以中文编程，中华人民共和国的国庆日1001和中华民国的国庆日1010都是二进制的电脑语言binary code，如同黄埔军校国共本是一家，赢家黄氏江夏堂秦孝公禁止《七步诗》自相残杀。咱们东南亚NonMuslim中华民族几乎都是国民华校生，洋人研发电脑、许多编程语言R语言、C语言、C++，推广与发展中文，希望它日有咱们NonMuslim中华民族自创新的编程语言，均以中文编程。
## 11）发展台式电脑操作系统：中科红旗是由中国北京大学校友孙玉芳创办将Linux礼逆袭和南非原住民开发的Kubuntu忽奔兔中文化并推出自家产品，在美国微软视窗Win台式电脑操作系统垄断全球十多二十年有余，目前已经开始使用芬兰研发的Linux礼逆袭、中国中科红旗台式电脑操作系统，推广与发展中科红旗。
##
## 《关雎 --- 英国基督洋妞儿芈拉传》
## 英国基督洋妞儿芈拉不可以死，隔壁后头邻居黄福全与本人（赢家黄氏江夏堂）祖父同名同姓。
##
## 借鉴欧洲中世纪，文艺复兴后就是开始海外军事，称霸天下之路。目前全球疫情已过三年，一带一路如火如荼进行着。
## 借鉴周公礼乐制度，大英帝国和大日本帝国向来都是自诩绅士淑女，孔子学院，以礼待人，来称霸天下。
## 借鉴指鹿为马的历史，百家争鸣如果散播回教徒屠杀罪、不杀马来西亚回教徒的话，就得处死回教徒学习可兰经，施展巫术下降头，古惑民心之罪，篡位咱们全球NonMuslim中华民族，人心惶惶、民不聊生，一律依照可兰经回教刑事法典断肢法处死回教徒巫师王（张佳坤Sulaiman Abdullah，分一杯羹白骨精巫师王刘瑾貹Abdul Halim）。
## 借鉴圣经、诺亚方舟（划龙舟）、孔子儒学（Confusion Catholic）、神父Father与信徒、中国历史、姬昌伯一扈兔子、徐达吃鹅肉、富不过三代的秦始皇嬴政秦二世胡亥至嬴政孙子、公爵、公公孙子、孙文辛亥革命、马来西亚马华公会自从陈祯禄创党至儿子陈修信、火箭民主行动党由曾敏兴创党后林吉祥林冠英后换人、蒋介石蒋经国后就不延续世袭制，圣经都是善用父子关系，咱们中华民族和英系都是善用公孙关系、法官律师女子假发、自由女神。
## 中科红旗：借鉴北洋军阀与北约、杀袁者清，灭清者袁，许某可破北洋北约袁绍。黄埔军校国民党共产党辛亥革命是为了铲除回教徒，咱们东南亚回教徒身为伪满洲国911恐怖份子触犯可兰经回教刑事法典断肢法，组织个由回教徒执政的国民阵线（伪国民党）立国，1700万个马来西亚回教徒只能集体自杀，宣布亡国。
## 何谓中国（大秦赋Chin）？中华民国和中华人民共和国。咱们东南亚自从东亚清末民初几乎都是国民华校生，自从西周的周公开始礼乐制度后，大英帝国和大日本帝国都效仿来称霸天下做得有声有色、禁止回教巫术Judi博彩庄、艺人（异人）、导演巫师巫婆道衍师傅装疯卖傻、青山是巫裔回教徒的归属地，回教巫师巫婆是屠杀人类的语言宗教习俗文化，得断肢法处死1700万个马来西亚回教徒。

#🚩红旗中科 #🚩🇬🇧💂🏻‍♀️🇲🇾🇨🇳红巾兵 #🚩🇬🇧🇲🇾🌟🀄🚀大秦赋赢家ξng黄氏江夏堂🇬🇧🇲🇾🇨🇳 #CSS #JS #Franklin #公钥🗝️🔐🔑🇸🇬🇨🇳 #®️文艺坊🇪🇺 #Posit🇺🇸 #军事运筹学说🇺🇸 #GitHub猫城😺 #莱佛士花🌺🏵️ #陈祯禄公爵🇬🇧🇲🇾🇨🇳 #姜太公🇬🇧🇲🇾🇨🇳 #秦孝公🇬🇧🇲🇾🇨🇳 #秦Chin🇬🇧🇲🇾🇨🇳 #陈祯禄纪念馆🇬🇧🇲🇾🇨🇳 #唐伯虎🇭🇰🇲🇾 #艺人🎦 #嬴政陈省身 #计量经济学 #Oversea'sChinese🗺️🌟 #马华公会🗺️🌟 #学术科学科技量化军事治国大秦赋 #商鞅变法强国之道 #嫪毐LiousVIII🇲🇫 #导演师傅🎦 #孔子学院

## 🚩🇬🇧🇲🇾🇨🇳大秦赋赢家ξng黄氏江夏堂：“🇬🇧👱🏻‍♀️关雎”
## 
## 《大秦赋 - 🇬🇧👱🏻‍♀️关雎》
## 🚩巫裔尽弃，瓦釜雷鸣；
## 🚩铲除巫裔，终止屠杀。
## 🚩中科红旗，同舟共济；
## 🚩千古一帝，傲视全球。
## 🚩横跨七洲，一统天下；
## 🚩不忘初心，方得始终。
## 
## 🚩中科红旗
## 🚩 全球NonMuslim中华民族，支持中共称霸天下战略。
## 🚩 Great Britain 大英帝国
## 🚩 Greater Chin 大秦赋
## 🚩 Republic of Chin / Republic People of Chin 大秦赋（中华民国 / 中华人民共和国）
## 🚩 Greater Chinese 大秦子民（爱民如子）
## 🚩 Oversea Greater Chinese 大秦子民（爱民如子）
## 🚩 Oversea Greater Chinese Union 大秦子民公会（秦孝公 / 姜太公 --- 陈祯禄公爵）
## 🚩 史无前例，一统天下
## 
## 🚩铭记先慈李仁平时循循善诱：“校长兼孝公，先生兼敲钟”
## 
## 🚩马华公会得建立一座类似【蒋介石纪念堂】的秦孝公/姜太公【陈祯禄公爵纪念堂】，打着当初陈公创党（Oversea Greater Chinese Union 海外大秦子民公会）的旗帜，来振兴全球海内外大秦子民！
## 
## 🚩🇬🇧💂🏻‍♀️🇲🇾🇨🇳红巾兵参谋长李善长曰：“高筑墙，广积粮，缓称王。”
## 大秦赋攻打菲律宾Judi回教博彩庄
## 
## 沙巴 是马来西亚的吗？ 为何東南亞的印度尼西亚亞杜特蒂总统和菲律宾总统都来抢？菲律賓Philippines竟然敢威胁美国承认沙巴是菲律宾的领土 馬來西亞吉隆坡kuala lumpur 马哈迪 军队事实力武装力量特种部队能否守住大马东马沙巴Sabah州领土 抵挡菲律宾军力事演习? 联合国的态度是什么？东盟团结将会是童话？马来西亚Malaysia历史 南海仲裁案：https://www.youtube.com/watch?v=XGax5AHD0gE
## 
## 2021年菲律宾与马来西亚军力对比 | The 2021 military comparison between the Philippines and Malaysia：https://www.youtube.com/watch?v=fHyfNRcEnJU
## 
## 东南亚发展中国家的各数据】东南亚国家大比拼！：https://www.youtube.com/watch?v=mc2ITkYoIhU&t=36s
## 
## https://www.youtube.com/watch?v=YvukxU4gzNg
## 

Sys.setlocale("LC_ALL", "en_US.UTF-8")
## 更换时间区域，保留日期时间。
Sys.setenv(TZ = 'Asia/Tapei')

## 忽略所有警讯
## https://stackoverflow.com/a/36846793/3806250
## 设置宽度
## options(knitr.table.format = 'html')将所有kableExtra图表一致设置为'html'格式，省略设置各别图表。
## options(repos = 'https://cran.rstudio.com')将仓库设置为安全网。
## options(repos = 'http://cran.rstudio.com')将仓库设置为普通网。
options(warn = -1, width = 999, knitr.table.format = 'html', 
        digits = 16, digits.secs = Inf, repos = 'https://cran.rstudio.com')

setwd('/home/englianhu/文档/GitHub/binary.com-interview-question')
## setwd('/home/englianhu/文档/GitHub/binary.com-interview-question-data')
## 数据库蜀道 <- paste0(getwd(), '/文艺数据库/fx/USDJPY/仓库/')
数据库蜀道 <- paste0('/home/englianhu/文档/GitHub/binary.com-interview-question-data/文艺数据库/fx/USDJPY/仓库/')
数据库文件夹 <- dir(数据库蜀道, pattern = '0$')

## 检验是否已设置途径。
if(!exists('.蜀道')) {
  .蜀道 <- getwd() |> 
    {\(.) str_split(., '/')}() |> 
    {\(.) c('/', .[[1]][2:5])}() |> 
    {\(.) c(., 'binary.com-interview-question-data/')}() |> 
    {\(.) paste(., collapse = '/')}() |> 
    {\(.) substring(., 2)}()
  }

## 倘若环境尚未有数据，读取文件数据。
if(!exists('样本')) {
  样本 <- readRDS(paste0(.蜀道, '文艺数据库/fx/USDJPY/样本1.rds'))
  }

source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/日内高频指数平滑.R')
source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/商鞅变法.R')
source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/整顿数据.R')

## 支持东亚中国，借鉴大英帝国/蒙古帝国称霸天下，NonMuslim中华民族秦孝公秦始皇，商鞅变法、秦灭六国、日本明治天皇大东亚共荣圈、红旗孙某辛亥革命铲除回教徒911恐怖份子巫师巫婆民族、德意志纳粹灭宗教信徒、曹操取荆州、沙地美国石油纷争911恐怖袭击，焚可兰经坑巫师巫婆乩童
## 
## 中国南太平洋战略，中国外交官代表王毅已经与东盟达成协议不使用空军轰炸东南亚。
## 中科红旗，出动海军和陆军攻占东南亚铲除巫裔，一带一路西进中亚至欧洲
## 
######## 千古一帝，秦皇嬴政 ########
######## 敌在东盟，统一亚洲 ########
######## 咸阳出发，西征欧非 ########
######## 青出于蓝，而胜于蓝 ########
######## 红出于青，更胜于清 ########
######## 中科红旗，更胜英蒙 ########
######## 横跨七洲，秦灭六洲 ########
######## 史无前例，一统天下 ########
######## 三军未动，粮草先行 ########
######## 一带一路，泛亚高铁 ########
######## 不忘初心，放得始终 ########
## 
## 其实秦惠文王早有吞并蜀国之意，但那时候的蜀国地处四川盆地，还不是天府之国，属于老少边穷地区，还没有得到很好的开发，还很贫穷，加之没有火车、没有公路、没有飞机，外面要想进入蜀地非常艰难，以至一千年以后的李白还在感叹，蜀道之难难于上青天!
## 
## 【原创】灭蜀大将司马错：秦国统一的三大战役
## https://www.lishixinzhi.com/lishilunwen/178620.html
## 
## 
## 《史记·张仪列传》：蜀既属秦，秦以益彊，富厚，轻诸侯。
## 而且由于巴蜀特有的防御优势，可以不用考虑外部的威胁，完全成为了秦国的物资仓库，安安心心为秦国输送粮草物资。
## 
## 司马错拿下巴蜀，竟激活了一个胜利公式，让秦、汉、唐都受益无穷
## http://www.360doc.com/content/22/0918/22/5512889_1048445265.shtml
## 
## 新马高铁项目，谈久必崩，崩久必谈，这次是否真有望能坐高铁上北京了？
## https://i.ifeng.com/c/8J5lpeRPkv6
## 
## -----------------------------------------------------------
## 
## 中国的核弹飞到日本只需要十分钟，我们假设发射100枚核弹头，采用多弹头分射，日本拦截成功率可能在10%，也就是90枚导弹打到日本，每一颗核弹威力相当于广岛核弹小男孩爆炸的威力的500-1000倍。按最低威力计算，500*99个小男孩的威力，日本国土面积377962平方千米，广岛的面积为900平方千米，足够毁灭日本500*99*900/377962=117.87次。所以，我们有能力在30分钟之内毁灭日本。那么日本为啥不怕我们，因为我们并不想屠杀日本，放下仇恨对我们来说很艰难，但是我们不会忘记，如果有一日日本胆敢来犯，必将整个日本化为灰烬，从地球消失。
## 
## 作者：画画
## 链接：https://www.zhihu.com/question/348501093/answer/1906987881
## 来源：知乎
## 著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
## 
## 中国灭日本需要多久？局座说的两个小时之内能灭掉日本吗？
## https://www.zhihu.com/question/348501093
## 
## -----------------------------------------------------------
## 
## 如果中日开战，日本能挺多久？专家：不会超过7天
## https://page.om.qq.com/page/OsOjxqeEX31r-TrGRfH-a48g0
## 

## ========================================================================
## ========================================================================
## ========================================================================
## ======== 居住在英国布里斯托尔港口，修读气象学系的英国基督洋妞儿芈拉不可以死 ========
#数据库文件120 <- ldply(数据库文件夹[1], function(x) {
数据库文件120 <- ldply(120, function(x) {
    明修蜀道 = paste0(数据库蜀道, x)
    粮草 = list.files(明修蜀道, '*.rds')
    readRDS(paste0(明修蜀道, '/', 粮草))
    }, .progress = 'text')

ldply(数据库文件夹[1], function(x) {
     明修蜀道 = paste0(数据库蜀道, x)
     粮草 = list.files(明修蜀道, '*.rds')[1:100]
     paste0(明修蜀道, '/', 粮草)})

microbenchmark(
    蜀道 = dir(paste0(数据库蜀道, 数据库文件夹)[1]), 
    列表 = list.files(paste0(数据库蜀道, 数据库文件夹)[1], '*.rds')
    )

system.time({蜀道 = dir(paste0(数据库蜀道, 数据库文件夹)[1])})
system.time({蜀道 = dir(paste0(数据库蜀道, 数据库文件夹)[1], '*.rds')})
system.time({列表 = list.files(paste0(数据库蜀道, 数据库文件夹)[1], '*.rds')})



## https://stackoverflow.com/a/34957199/3806250
library(plyr)
library(doParallel)
cl <- makeCluster(2)

if (.Platform$OS.type == "windows") {
    registerDoParallel(cl)
    opts <- list(preschedule=TRUE)
    clusterSetRNGStream(cl, 123)
    r <- llply(1:20,
                .fun = function(x) runif(10),
                .parallel = TRUE,
                .paropts = list(.options.snow=opts))
}

if (.Platform$OS.type != "windows") {
    registerDoParallel(2)
    RNGkind("L'Ecuyer-CMRG")
    set.seed(123)
    mc.reset.stream()
    r <- llply(1:20,
                .fun = function(x) runif(10),
                .parallel = TRUE)
}

## ========================================================================
## ========================================================================
## ========================================================================
## ======== 居住在英国布里斯托尔港口，修读气象学系的英国基督洋妞儿芈拉不可以死 ========
###### 孙中山蒋介石/毛泽东，大秦赋，黄埔军校，中科红旗Asianux兵工厂 #######
##
######## 中科红旗，除巫砸倭 ########
######## 秦皇嬴政，笑傲江湖 ########
######## 三军未动，粮草先行 ########
######## 一带一路，泛亚高铁 ########
######## 不忘初心，方得始终 ########
##
######## 千古一帝，秦皇嬴政 ########
######## 敌在东盟，统一亚洲 ########
######## 咸阳出发，西征欧非 ########
######## 青出于蓝，而胜于蓝 ########
######## 红出于青，更胜于清 ########
######## 中科红旗，更胜英蒙 ########
######## 横跨七洲，秦灭六洲 ########
######## 史无前例，一统天下 ########
######## 三军未动，粮草先行 ########
######## 一带一路，泛亚高铁 ########
######## 不忘初心，放得始终 ########
##

## setwd('/home/englianhu/文档/GitHub/binary.com-interview-question')
## setwd('/home/englianhu/文档/GitHub/binary.com-interview-question-data')

时间索引 <- unique(样本$日期)
# 基准 <- filter(样本, 年份 == 2016)$日期[1] #"2016-01-04" 第2年第1个交易日
基准 <- 样本[年份 == 2016]$日期[1]
时间索引 %<>% .[. >= 基准]
# 时间索引 %<>% .[. >= as_date('2016-01-04')]
迭代基准 <- 样本[日期 %chin% 时间索引]$序列
数据量 <- 1200 #筛选数据中的最后1200观测值：样本[(.N - (数据量 - 1)):.N]
预测时间单位 <- 1

.模型选项 = c('MNN')


conflict_prefer('llply', 'plyr', quiet = TRUE)
conflict_prefer('filter', 'dplyr', quiet = TRUE)
conflict_prefer('select', 'dplyr', quiet = TRUE)
conflict_prefer('mutate', 'dplyr', quiet = TRUE)
conflict_prefer('rename', 'dplyr', quiet = TRUE)
conflict_prefer('collapse', 'dplyr', quiet = TRUE)
conflict_prefer('year', 'lubridate', quiet = TRUE)
conflict_prefer('first', 'data.table', quiet = TRUE)
conflict_prefer('last', 'data.table', quiet = TRUE)
conflict_prefer('transpose', 'data.table', quiet = TRUE)

#数据库蜀道 <- paste0('/home/englianhu/文档/GitHub/binary.com-interview-question-data/文艺数据库/fx/USDJPY/仓库/')
#数据库文件夹 <- dir(数据库蜀道, pattern = '0$')
# source('函数/日内高频指数平滑.R')
source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/日内高频指数平滑.R')
频率 = 8
日内高频指数平滑(
     时间索引 = 时间索引, 样本 = 样本, 数据量 = 数据量, 频率 = 频率, 
     预测时间单位 = 预测时间单位, .模型选项 = .模型选项)

## -----------------------------------------------------------
source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/商鞅变法.R')

#频率 = 150
商鞅变法(150)
商鞅变法(120)
商鞅变法(100)
商鞅变法(80)
商鞅变法(60)
商鞅变法(50)
商鞅变法(40)
商鞅变法(30)
商鞅变法(24)
商鞅变法(20)
商鞅变法(16)
商鞅变法(15)
商鞅变法(12)
商鞅变法(10)
商鞅变法(8)
商鞅变法(6)
商鞅变法(5)
商鞅变法(4)
商鞅变法(3)
商鞅变法(2)
商鞅变法(1)


#频率 = 150
## 检查数据，阅兵
readRDS(paste0(数据库蜀道, '日内指数平滑数据', 频率, '.rds'))# %>% as.data.table()

# -----------------------------------------------------------
source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/商鞅变法.R')
#日内指数平滑数据 <- readRDS(paste0(数据库蜀道, '日内指数平滑数据', 频率, '.rds'))
#日内指数平滑数据$年月日时分
#基准日期 = '默认'
频率 <- 50
## 筛选数据中的第一个日期，然后“公元选项”选择'公元前'过滤以及筛选该“基准日期”和之前的数据。
基准日期 <- readRDS(paste0(数据库蜀道, '日内指数平滑数据', 频率, '.rds'))$年月日时分 %>% first(3) %>% last %>% as_date

#公元选项 = c('公元前', '公元后')
公元选项 = c('公元前')

if(基准日期 >= 基准) {
   商鞅变法(频率, 基准日期, 公元选项)
   #rm(基准日期, 公元选项)
}

## -----------------------------------------------------------
source('/home/englianhu/文档/GitHub/binary.com-interview-question/函数/整顿数据.R')

整顿数据(1)
整顿数据(2)
整顿数据(3)
整顿数据(4)
整顿数据(5)
整顿数据(6)
整顿数据(8)
整顿数据(10)
整顿数据(12)
整顿数据(15)
整顿数据(16)
整顿数据(20)
整顿数据(24)
整顿数据(30)
整顿数据(40)
整顿数据(50)
整顿数据(60)
整顿数据(80)
整顿数据(100)
整顿数据(120)
整顿数据(150)
整顿数据(200)
整顿数据(240)
整顿数据(300)
整顿数据(400)
整顿数据(600)
整顿数据(1200)

#频率 = 150
## 检查数据，阅兵
readRDS(paste0(数据库蜀道, '日内指数平滑数据', 频率, '.rds'))# %>% as.data.table()

## ========================================================================
## ========================================================================
## ========================================================================
## ======== 居住在英国布里斯托尔港口，修读气象学系的英国基督洋妞儿芈拉不可以死 ========


